# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'alt-tab'
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'go'
brew 'grep'
brew 'ffmpeg'
brew 'htop'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'midnight-commander'
brew 'ncdu'
brew 'tldr'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 's3cmd'
brew 'youtube-dl'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'cheatsheet'
cask 'choosy'
cask 'csvkit'
cask 'bartender'
cask 'battle-net'
cask 'deepl'
cask 'docker'
cask 'evernote'
cask 'figma'
cask 'flux'
cask 'google-chrome'
cask 'imageoptim'
cask 'iina'
cask 'insomnia'
cask 'iterm2'
cask 'mattermost'
cask 'mimestream'
cask 'notion'
cask 'obsidian'
cask 'phpstorm'
cask 'sequel-ace'
cask 'skype'
cask 'spotify'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
cask 'twist'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'WebPQuickLook'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
# mas 'Telegram', id: 
mas 'Things', id: 904280696

